; domain
(define (domain Depot)
(:requirements :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z))))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))

)

; problem
(define (problem depotprob4534) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 crate14 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear crate7)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear crate8)
	(at pallet4 distributor1)
	(clear crate12)
	(at pallet5 distributor2)
	(clear crate11)
	(at pallet6 depot1)
	(clear crate4)
	(at pallet7 distributor0)
	(clear crate9)
	(at pallet8 depot2)
	(clear crate13)
	(at pallet9 distributor0)
	(clear crate14)
	(at truck0 distributor1)
	(at truck1 distributor2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at crate0 distributor2)
	(on crate0 pallet5)
	(at crate1 distributor1)
	(on crate1 pallet4)
	(at crate2 depot2)
	(on crate2 pallet8)
	(at crate3 depot2)
	(on crate3 crate2)
	(at crate4 depot1)
	(on crate4 pallet6)
	(at crate5 distributor2)
	(on crate5 crate0)
	(at crate6 depot1)
	(on crate6 pallet1)
	(at crate7 depot1)
	(on crate7 crate6)
	(at crate8 distributor0)
	(on crate8 pallet3)
	(at crate9 distributor0)
	(on crate9 pallet7)
	(at crate10 distributor1)
	(on crate10 crate1)
	(at crate11 distributor2)
	(on crate11 crate5)
	(at crate12 distributor1)
	(on crate12 crate10)
	(at crate13 depot2)
	(on crate13 crate3)
	(at crate14 distributor0)
	(on crate14 pallet9)
)

(:goal (and
		(on crate0 crate8)
		(on crate1 crate10)
		(on crate2 pallet0)
		(on crate3 pallet1)
		(on crate4 crate7)
		(on crate5 pallet5)
		(on crate6 pallet6)
		(on crate7 pallet4)
		(on crate8 pallet7)
		(on crate9 crate4)
		(on crate10 crate11)
		(on crate11 crate9)
		(on crate12 crate5)
		(on crate13 pallet8)
		(on crate14 pallet9)
	)
)(:metric minimize (total-time)))

; plan
1. (drive truck1 distributor2 depot2)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot2)
   goals met: 1 of 15
2. (lift hoist2 crate13 crate3 depot2)
   deleted: (at crate13 depot2) (clear crate13) (available hoist2) (on crate13 crate3)
   added: (lifting hoist2 crate13) (clear crate3)
   goals met: 1 of 15
3. (load hoist2 crate13 truck1 depot2)
   deleted: (lifting hoist2 crate13)
   added: (in crate13 truck1) (available hoist2)
   goals met: 1 of 15
4. (lift hoist2 crate3 crate2 depot2)
   deleted: (at crate3 depot2) (clear crate3) (available hoist2) (on crate3 crate2)
   added: (lifting hoist2 crate3) (clear crate2)
   goals met: 1 of 15
5. (load hoist2 crate3 truck1 depot2)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck1) (available hoist2)
   goals met: 1 of 15
6. (lift hoist2 crate2 pallet8 depot2)
   deleted: (at crate2 depot2) (clear crate2) (available hoist2) (on crate2 pallet8)
   added: (lifting hoist2 crate2) (clear pallet8)
   goals met: 1 of 15
7. (load hoist2 crate2 truck1 depot2)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck1) (available hoist2)
   goals met: 1 of 15
8. (unload hoist2 crate13 truck1 depot2)
   deleted: (in crate13 truck1) (available hoist2)
   added: (lifting hoist2 crate13)
   goals met: 1 of 15
9. (drop hoist2 crate13 pallet8 depot2)
   deleted: (lifting hoist2 crate13) (clear pallet8)
   added: (available hoist2) (at crate13 depot2) (clear crate13) (on crate13 pallet8)
   goals met: 2 of 15
10. (drive truck1 depot2 depot0)
   deleted: (at truck1 depot2)
   added: (at truck1 depot0)
   goals met: 2 of 15
11. (unload hoist0 crate2 truck1 depot0)
   deleted: (in crate2 truck1) (available hoist0)
   added: (lifting hoist0 crate2)
   goals met: 2 of 15
12. (drop hoist0 crate2 pallet0 depot0)
   deleted: (lifting hoist0 crate2) (clear pallet0)
   added: (available hoist0) (at crate2 depot0) (clear crate2) (on crate2 pallet0)
   goals met: 3 of 15
13. (drive truck1 depot0 depot1)
   deleted: (at truck1 depot0)
   added: (at truck1 depot1)
   goals met: 3 of 15
14. (lift hoist1 crate7 crate6 depot1)
   deleted: (at crate7 depot1) (clear crate7) (available hoist1) (on crate7 crate6)
   added: (lifting hoist1 crate7) (clear crate6)
   goals met: 3 of 15
15. (load hoist1 crate7 truck1 depot1)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck1) (available hoist1)
   goals met: 3 of 15
16. (lift hoist1 crate6 pallet1 depot1)
   deleted: (at crate6 depot1) (clear crate6) (available hoist1) (on crate6 pallet1)
   added: (lifting hoist1 crate6) (clear pallet1)
   goals met: 3 of 15
17. (load hoist1 crate6 truck1 depot1)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck1) (available hoist1)
   goals met: 3 of 15
18. (unload hoist1 crate3 truck1 depot1)
   deleted: (in crate3 truck1) (available hoist1)
   added: (lifting hoist1 crate3)
   goals met: 3 of 15
19. (drop hoist1 crate3 pallet1 depot1)
   deleted: (lifting hoist1 crate3) (clear pallet1)
   added: (available hoist1) (at crate3 depot1) (clear crate3) (on crate3 pallet1)
   goals met: 4 of 15
20. (lift hoist5 crate11 crate5 distributor2)
   deleted: (at crate11 distributor2) (clear crate11) (available hoist5) (on crate11 crate5)
   added: (lifting hoist5 crate11) (clear crate5)
   goals met: 4 of 15
21. (drive truck1 depot1 distributor1)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor1)
   goals met: 4 of 15
22. (lift hoist4 crate12 crate10 distributor1)
   deleted: (at crate12 distributor1) (clear crate12) (available hoist4) (on crate12 crate10)
   added: (lifting hoist4 crate12) (clear crate10)
   goals met: 4 of 15
23. (load hoist4 crate12 truck1 distributor1)
   deleted: (lifting hoist4 crate12)
   added: (in crate12 truck1) (available hoist4)
   goals met: 4 of 15
24. (lift hoist4 crate10 crate1 distributor1)
   deleted: (at crate10 distributor1) (clear crate10) (available hoist4) (on crate10 crate1)
   added: (lifting hoist4 crate10) (clear crate1)
   goals met: 4 of 15
25. (load hoist4 crate10 truck1 distributor1)
   deleted: (lifting hoist4 crate10)
   added: (in crate10 truck1) (available hoist4)
   goals met: 4 of 15
26. (lift hoist4 crate1 pallet4 distributor1)
   deleted: (at crate1 distributor1) (clear crate1) (available hoist4) (on crate1 pallet4)
   added: (lifting hoist4 crate1) (clear pallet4)
   goals met: 4 of 15
27. (load hoist4 crate1 truck0 distributor1)
   deleted: (lifting hoist4 crate1)
   added: (in crate1 truck0) (available hoist4)
   goals met: 4 of 15
28. (unload hoist4 crate7 truck1 distributor1)
   deleted: (in crate7 truck1) (available hoist4)
   added: (lifting hoist4 crate7)
   goals met: 4 of 15
29. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   goals met: 4 of 15
30. (load hoist5 crate11 truck0 distributor2)
   deleted: (lifting hoist5 crate11)
   added: (in crate11 truck0) (available hoist5)
   goals met: 4 of 15
31. (lift hoist5 crate5 crate0 distributor2)
   deleted: (at crate5 distributor2) (clear crate5) (available hoist5) (on crate5 crate0)
   added: (lifting hoist5 crate5) (clear crate0)
   goals met: 4 of 15
32. (load hoist5 crate5 truck0 distributor2)
   deleted: (lifting hoist5 crate5)
   added: (in crate5 truck0) (available hoist5)
   goals met: 4 of 15
33. (lift hoist5 crate0 pallet5 distributor2)
   deleted: (at crate0 distributor2) (clear crate0) (available hoist5) (on crate0 pallet5)
   added: (lifting hoist5 crate0) (clear pallet5)
   goals met: 4 of 15
34. (load hoist5 crate0 truck0 distributor2)
   deleted: (lifting hoist5 crate0)
   added: (in crate0 truck0) (available hoist5)
   goals met: 4 of 15
35. (unload hoist5 crate5 truck0 distributor2)
   deleted: (in crate5 truck0) (available hoist5)
   added: (lifting hoist5 crate5)
   goals met: 4 of 15
36. (drop hoist5 crate5 pallet5 distributor2)
   deleted: (lifting hoist5 crate5) (clear pallet5)
   added: (available hoist5) (at crate5 distributor2) (clear crate5) (on crate5 pallet5)
   goals met: 5 of 15
37. (lift hoist1 crate4 pallet6 depot1)
   deleted: (at crate4 depot1) (clear crate4) (available hoist1) (on crate4 pallet6)
   added: (lifting hoist1 crate4) (clear pallet6)
   goals met: 5 of 15
38. (drop hoist1 crate4 crate3 depot1)
   deleted: (lifting hoist1 crate4) (clear crate3)
   added: (available hoist1) (at crate4 depot1) (clear crate4) (on crate4 crate3)
   goals met: 5 of 15
39. (drive truck1 distributor1 depot1)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot1)
   goals met: 5 of 15
40. (unload hoist1 crate6 truck1 depot1)
   deleted: (in crate6 truck1) (available hoist1)
   added: (lifting hoist1 crate6)
   goals met: 5 of 15
41. (drop hoist1 crate6 pallet6 depot1)
   deleted: (lifting hoist1 crate6) (clear pallet6)
   added: (available hoist1) (at crate6 depot1) (clear crate6) (on crate6 pallet6)
   goals met: 6 of 15
42. (lift hoist3 crate9 pallet7 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist3) (on crate9 pallet7)
   added: (lifting hoist3 crate9) (clear pallet7)
   goals met: 6 of 15
43. (drop hoist3 crate9 crate14 distributor0)
   deleted: (lifting hoist3 crate9) (clear crate14)
   added: (available hoist3) (at crate9 distributor0) (clear crate9) (on crate9 crate14)
   goals met: 6 of 15
44. (lift hoist3 crate8 pallet3 distributor0)
   deleted: (at crate8 distributor0) (clear crate8) (available hoist3) (on crate8 pallet3)
   added: (lifting hoist3 crate8) (clear pallet3)
   goals met: 6 of 15
45. (drop hoist3 crate8 pallet7 distributor0)
   deleted: (lifting hoist3 crate8) (clear pallet7)
   added: (available hoist3) (at crate8 distributor0) (clear crate8) (on crate8 pallet7)
   goals met: 7 of 15
46. (drop hoist4 crate7 pallet4 distributor1)
   deleted: (lifting hoist4 crate7) (clear pallet4)
   added: (available hoist4) (at crate7 distributor1) (clear crate7) (on crate7 pallet4)
   goals met: 8 of 15
47. (lift hoist1 crate4 crate3 depot1)
   deleted: (at crate4 depot1) (clear crate4) (available hoist1) (on crate4 crate3)
   added: (lifting hoist1 crate4) (clear crate3)
   goals met: 8 of 15
48. (load hoist1 crate4 truck1 depot1)
   deleted: (lifting hoist1 crate4)
   added: (in crate4 truck1) (available hoist1)
   goals met: 8 of 15
49. (drive truck1 depot1 distributor2)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor2)
   goals met: 8 of 15
50. (unload hoist5 crate12 truck1 distributor2)
   deleted: (in crate12 truck1) (available hoist5)
   added: (lifting hoist5 crate12)
   goals met: 8 of 15
51. (drop hoist5 crate12 crate5 distributor2)
   deleted: (lifting hoist5 crate12) (clear crate5)
   added: (available hoist5) (at crate12 distributor2) (clear crate12) (on crate12 crate5)
   goals met: 9 of 15
52. (drive truck1 distributor2 distributor1)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor1)
   goals met: 9 of 15
53. (unload hoist4 crate4 truck1 distributor1)
   deleted: (in crate4 truck1) (available hoist4)
   added: (lifting hoist4 crate4)
   goals met: 9 of 15
54. (drop hoist4 crate4 crate7 distributor1)
   deleted: (lifting hoist4 crate4) (clear crate7)
   added: (available hoist4) (at crate4 distributor1) (clear crate4) (on crate4 crate7)
   goals met: 10 of 15
55. (drive truck0 distributor2 distributor0)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor0)
   goals met: 10 of 15
56. (lift hoist3 crate9 crate14 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist3) (on crate9 crate14)
   added: (lifting hoist3 crate9) (clear crate14)
   goals met: 10 of 15
57. (load hoist3 crate9 truck0 distributor0)
   deleted: (lifting hoist3 crate9)
   added: (in crate9 truck0) (available hoist3)
   goals met: 10 of 15
58. (unload hoist3 crate0 truck0 distributor0)
   deleted: (in crate0 truck0) (available hoist3)
   added: (lifting hoist3 crate0)
   goals met: 10 of 15
59. (drop hoist3 crate0 crate8 distributor0)
   deleted: (lifting hoist3 crate0) (clear crate8)
   added: (available hoist3) (at crate0 distributor0) (clear crate0) (on crate0 crate8)
   goals met: 11 of 15
60. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 11 of 15
61. (unload hoist4 crate9 truck0 distributor1)
   deleted: (in crate9 truck0) (available hoist4)
   added: (lifting hoist4 crate9)
   goals met: 11 of 15
62. (drop hoist4 crate9 crate4 distributor1)
   deleted: (lifting hoist4 crate9) (clear crate4)
   added: (available hoist4) (at crate9 distributor1) (clear crate9) (on crate9 crate4)
   goals met: 12 of 15
63. (unload hoist4 crate11 truck0 distributor1)
   deleted: (in crate11 truck0) (available hoist4)
   added: (lifting hoist4 crate11)
   goals met: 12 of 15
64. (drop hoist4 crate11 crate9 distributor1)
   deleted: (lifting hoist4 crate11) (clear crate9)
   added: (available hoist4) (at crate11 distributor1) (clear crate11) (on crate11 crate9)
   goals met: 13 of 15
65. (unload hoist4 crate10 truck1 distributor1)
   deleted: (in crate10 truck1) (available hoist4)
   added: (lifting hoist4 crate10)
   goals met: 13 of 15
66. (drop hoist4 crate10 crate11 distributor1)
   deleted: (lifting hoist4 crate10) (clear crate11)
   added: (available hoist4) (at crate10 distributor1) (clear crate10) (on crate10 crate11)
   goals met: 14 of 15
67. (unload hoist4 crate1 truck0 distributor1)
   deleted: (in crate1 truck0) (available hoist4)
   added: (lifting hoist4 crate1)
   goals met: 14 of 15
68. (drop hoist4 crate1 crate10 distributor1)
   deleted: (lifting hoist4 crate1) (clear crate10)
   added: (available hoist4) (at crate1 distributor1) (clear crate1) (on crate1 crate10)
   goals met: 15 of 15
